Revit 2027 API
WoodPoreType Enumeration
 The enumerated type representing the permitted values for the asset property "WoodPoreType" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WoodPoreType
Public Enumeration WoodPoreType
public enum class WoodPoreType
type WoodPoreType
Members
Member name | Value | Description
EarlywoodOnly | 1
InBothWoods | 0
LatewoodOnly | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace